# Pandas
Library for data analysis

## Pandas DataFrames
Tabular datastructure with labeled rows and columns

Rows: Labeled by special data structure called index.

### Index :
Tabled list of labels that permit fast lookup and some relational operations.

Index labels in Apple dataframe = dates in reverse chronological order.

![dataframe](Images/dataframe.png)

## Working with DataFrame in memory

![indexes](Images/indexes.png)

Notice that AAPL.columns is also pandas index.

![datetimeindex](Images/datetimeindex.png)

The AAPL.index attribute in this case is of special kind - called DatetimeIndex

Dataframes can be sliced like Numpy arrays or python lists:
![slicing](Images/slicing.png)

### head() method
Another way to see the first few rows of data:
![head](Images/head.png)

### tail() method
Accessing the last 5 rows:
![tail](Images/tail.png)

### info()
Useful summary for large dataframes
![info](Images/info.png)

## Series
- Columns of a Dataframe are themselves a specialized Pandas structure called a Series.
- Extracting a single column from a DataFrame returns a Series.
- The Series extracted has its own head method and inherits its name attribute from Dataframe column.

### values attribute:
- To extract numerical entities from Series
- Yields a Numpy array

![series](Images/series.png)

Pandas Series = 1D labelled Numpy array
Pandas Dataframe = 2D labelled array whose columns are Series
![series and dataframe](Images/series-and-dataframe.png)

In [1]:
import pandas as pd
type(AAPL)

TypeError: type() takes 1 or 3 arguments

In [ ]:
AAPL.shape

In [2]:
AAPL.columns

NameError: name 'AAPL' is not defined

In [ ]:
type(AAPL.columns)

## Building DataFrames from scratch

### DataFrames from CSV files
![csv_dataframes](Images/csv_dataframes.png)

## Creating DataFrames from Dictionary

### Method 1

In [5]:
import pandas as pd
# keys of dictionary data are used as column labels
data = {'weekday' : ['Sun', 'Sun', 'Mon', 'Mon'],
        'city' : [' Austin', ' Dallas', ' Austin', ' Dallas'],
        'visitors' : [139,237,326,456],
        'signups' : [7,12,3,5]}
users = pd.DataFrame(data)
print(users)

  weekday     city  visitors  signups
0     Sun   Austin       139        7
1     Sun   Dallas       237       12
2     Mon   Austin       326        3
3     Mon   Dallas       456        5

With no index specified, the row labels are integers 0 to 3 by default

### Method 2

In [6]:
cities = [' Austin', ' Dallas', ' Austin', ' Dallas']
signups = [7,12,3,5]
visitors = [139,237,326,456]
weekdays = ['Sun', 'Sun', 'Mon', 'Mon']
list_labels = ['city', 'signups', 'visitors', 'weekday']
list_cols = [cities, signups, visitors, weekdays]  # A list of lists
zipped = list(zip(list_labels,list_cols))

In [7]:
data = dict(zipped)
users = pd.DataFrame(data)
users

      city  signups  visitors weekday
0   Austin        7       139     Sun
1   Dallas       12       237     Sun
2   Austin        3       326     Mon
3   Dallas        5       456     Mon

## Broadcasting

In [8]:
users['fees'] = 0 #Broadcasts value to entire column
users

      city  signups  visitors weekday  fees
0   Austin        7       139     Sun     0
1   Dallas       12       237     Sun     0
2   Austin        3       326     Mon     0
3   Dallas        5       456     Mon     0

## Relabeling

In [10]:
users.columns

Index(['city', 'signups', 'visitors', 'weekday', 'fees'], dtype='object')

In [12]:
list_labels = ['City','Sign-ups','Visitors','Weekday', 'Fees']
users.columns = list_labels
users.columns

Index(['City', 'Sign-ups', 'Visitors', 'Weekday', 'Fees'], dtype='object')

## Importing and Exporting Data from Data in CSV

### Dataset: Sunspot observations collected from SILSO (Sunspot Index and Long-term Solar Observations)
(Source : SILSO Daily total sunspot number http://www.sidc.be/silso/infossntotdaily)

Over 70k rows

In [14]:
filepath = 'ISSN_D_tot.csv'
#read_csv function requires a string describing a filepath as input
sunspots = pd.read_csv(filepath)  #sunspots = dataframe
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72103 entries, 0 to 72102
Data columns (total 6 columns):
1818        72103 non-null int64
01          72103 non-null int64
01.1        72103 non-null int64
1818.004    72103 non-null float64
 -1         72103 non-null int64
1           72103 non-null int64
dtypes: float64(1), int64(5)
memory usage: 3.3 MB

- We can see that DataFrame mostly has integer or floating point entries.
- Index of the DataFrame(the row labels) are of type RangeIndex(Just Integers).

In [16]:
sunspots.iloc[10:20,:]

    1818  01  01.1  1818.004   -1  1
10  1818   1    12  1818.034   -1  1
11  1818   1    13  1818.037   22  1
12  1818   1    14  1818.040   -1  1
13  1818   1    15  1818.042   -1  1
14  1818   1    16  1818.045   -1  1
15  1818   1    17  1818.048   46  1
16  1818   1    18  1818.051   59  1
17  1818   1    19  1818.053   63  1
18  1818   1    20  1818.056   -1  1
19  1818   1    21  1818.059   -1  1

Some problems we can notice:
    - The column headers don't make sense
    - Many -1 entries in one column

Reasoning:
    
1. CSV file has no column headers.

Column meanings from SILSO website:

![alternate](Images/SILSO_columns.png)

2. Missing values in column 4 : indicated by -1.

    We need to take care of those.
    
3. Data representation is inconvenient.

### Let's tidy this up!

In [20]:
sunspots = pd.read_csv(filepath, header=None)  
#header=None prevents pandas from assuming first line of file gives column labels.
#Alternatively,an integer header argument gives the row number(indexed from 0) where column labels actually are and data begins

In [21]:
sunspots.iloc[10:20,:]

       0  1   2         3   4  5
10  1818  1  11  1818.031  -1  1
11  1818  1  12  1818.034  -1  1
12  1818  1  13  1818.037  22  1
13  1818  1  14  1818.040  -1  1
14  1818  1  15  1818.042  -1  1
15  1818  1  16  1818.045  -1  1
16  1818  1  17  1818.048  46  1
17  1818  1  18  1818.051  59  1
18  1818  1  19  1818.053  63  1
19  1818  1  20  1818.056  -1  1

Now, rows and columns are assigned integers from 0 as labels.

In [22]:
col_names = ['year', 'month', 'day', 'dec_date', 'sunspots', 'definite']
sunspots = pd.read_csv(filepath, header=None, names=col_names)  #names keyword is the important bit here
sunspots.iloc[10:20,:]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031        -1         1
11  1818      1   12  1818.034        -1         1
12  1818      1   13  1818.037        22         1
13  1818      1   14  1818.040        -1         1
14  1818      1   15  1818.042        -1         1
15  1818      1   16  1818.045        -1         1
16  1818      1   17  1818.048        46         1
17  1818      1   18  1818.051        59         1
18  1818      1   19  1818.053        63         1
19  1818      1   20  1818.056        -1         1

In [23]:
# Reading -1 entries as Not a Number or NaN, sometimes called a null value
sunspots = pd.read_csv(filepath, header=None, names=col_names, na_values='-1')
sunspots.iloc[10:20,:]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031        -1         1
11  1818      1   12  1818.034        -1         1
12  1818      1   13  1818.037        22         1
13  1818      1   14  1818.040        -1         1
14  1818      1   15  1818.042        -1         1
15  1818      1   16  1818.045        -1         1
16  1818      1   17  1818.048        46         1
17  1818      1   18  1818.051        59         1
18  1818      1   19  1818.053        63         1
19  1818      1   20  1818.056        -1         1

But the data still shows -1.

Looking at CSV file, there are space characters preceding -1 throughout column 4.

In [24]:
sunspots = pd.read_csv(filepath, header=None, names=col_names, na_values=' -1')
sunspots.iloc[10:20,:]

    year  month  day  dec_date  sunspots  definite
10  1818      1   11  1818.031       NaN         1
11  1818      1   12  1818.034       NaN         1
12  1818      1   13  1818.037      22.0         1
13  1818      1   14  1818.040       NaN         1
14  1818      1   15  1818.042       NaN         1
15  1818      1   16  1818.045       NaN         1
16  1818      1   17  1818.048      46.0         1
17  1818      1   18  1818.051      59.0         1
18  1818      1   19  1818.053      63.0         1
19  1818      1   20  1818.056       NaN         1

### Loading year,month,date columns in a better way:
The parse_dates keyword in read_csv infers dates intelligently.

In [26]:
sunspots = pd.read_csv(filepath, header=None, names=col_names, na_values={'sunspots':[-1]}, parse_dates=[[0,1,2]])
# parse_dates uses a list of list to inform read_csv which columns hold the dates
sunspots.iloc[10:20,:]

   year_month_day  dec_date  sunspots  definite
10     1818-01-11  1818.031        -1         1
11     1818-01-12  1818.034        -1         1
12     1818-01-13  1818.037        22         1
13     1818-01-14  1818.040        -1         1
14     1818-01-15  1818.042        -1         1
15     1818-01-16  1818.045        -1         1
16     1818-01-17  1818.048        46         1
17     1818-01-18  1818.051        59         1
18     1818-01-19  1818.053        63         1
19     1818-01-20  1818.056        -1         1

In [27]:
sunspots.info()
# year_month_day has entries of type datetime64

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72104 entries, 0 to 72103
Data columns (total 4 columns):
year_month_day    72104 non-null datetime64[ns]
dec_date          72104 non-null float64
sunspots          72104 non-null int64
definite          72104 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(2)
memory usage: 2.2 MB

### Giving meaningful row labels in index

In [28]:
sunspots.index = sunspots['year_month_day']
sunspots.index.name = 'date'
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 72104 entries, 1818-01-01 to 2015-05-31
Data columns (total 4 columns):
year_month_day    72104 non-null datetime64[ns]
dec_date          72104 non-null float64
sunspots          72104 non-null int64
definite          72104 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(2)
memory usage: 2.8 MB

### Trimming redundant columns

In [29]:
#list the meaningful columns and extract them
# Result = more compact dataframe with only meaningful data
cols = ['sunspots', 'definite']
sunspots = sunspots[cols]
sunspots.iloc[10:20,:]

            sunspots  definite
date
1818-01-11        -1         1
1818-01-12        -1         1
1818-01-13        22         1
1818-01-14        -1         1
1818-01-15        -1         1
1818-01-16        -1         1
1818-01-17        46         1
1818-01-18        59         1
1818-01-19        63         1
1818-01-20        -1         1